# -*- coding: utf-8 -*-
import time

from equivalence.delete_switches.equivalence_node.search_area_by_name import na_of_the_area_by_name
from icecream import ic

from equivalence.AstraRastr import RASTR
from equivalence.Load import LoadFile
from equivalence.test.model.dirModel import DirModel
from equivalence.tools.tool import changing_number_of_semicolons

area_list = [
    "Свердловская область",
    "Челябинская область",
    "Республика Башкортостан",
    "Курганская область",
    "Удмуртская Республика",
    "Кировская область",
    "Тюменская область",
    "Саратовская область",
    "Ульяновская область",
    "Пензенская область",
    "Республика Татарстан (Татарстан)",
    "Чувашская Республика - Чувашия",
    "Республика Мордовия",
    "Республика Марий Эл",
    "Ростовская область",
    "Республика Калмыкия",
    "Волгоградская область",
    "Астраханская область",
    "Мурманская область",
    "Республика Карелия",
    "Новгородская область",
    "Псковская область",
    "Калининградская область",
    "Архангельская область",
    "Республика Коми",
    "Москва",
    "Тульская область",
    "Ивановская область",
    "Владимирская область",
    "Ярославская область",
    "Костромская область",
    "Тверская область",
    "Смоленская область",
    "Брянская область",
    "Орловская область",
    "Курская область",
    "Липецкая область",
    "Воронежская область",
    "Белгородская область",
    "Тамбовская область",
    "Вологодская область",
    "Рязанская область",
    "Калужская область",
    "Финляндская Республика",
    "Западный регион",
    "Республика Беларусь",
    "Эстонская Республика",
    "Латвийская Республика",
    "Самарская область",
    "Швеция",
    "Нижегородская область",
    "Краснодарский край",
    "Литовская Республика",
    "Ленинградская область",
    "Санкт-Петербург",
    "Южный регион ",
    "Пермский край",
    "Днепровский регион",
    "Донбасский регион",
    "Северный регион",
    "Республика Крым",
    "Юго-Западный регион",
    "Ханты-Мансийский автономный округ - Югра",
    "Оренбургская область",
    "Московская область",
    "Центральный регион ",
]

load_ = LoadFile(rastr_win=RASTR)
load_.load(path_file=DirModel.fullDirName, name_shabl_russian='режим')

start = time.time()
list_ = []
for name in area_list:
    na = na_of_the_area_by_name(rastr_win=RASTR, name_area=name)
    list_.append(f"{name} - {na}")
ic(list_)
end = time.time()

print(
    f'Время работы: '
    f'{changing_number_of_semicolons(number=(end - start), digits=3)} сек.')

# save_file(path_file="search_area_by_name.rg2", name_shabl_russian='режим')
